#63 tuple2=(1,2,3,4,5..25) หาจำนวนเฉพาะ -> จำนวนที่หาร ด้วย 1 และตัวมันเอง ได้เท่านั้น 
#1.สร้าง tuple ตามโจทย์

tuple1=(1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20 ,21,22,23,24,25)
#print("tuple = ",tuple1)

#หาจำนวนเฉพาะ logic คือ มัน ต้องหาร 1 และ ตัวมันเองลงตัวเท่านั้น = 2   ดังนั้น ถ้ามีการหารจำนวนแล้ว
#มีมากกว่า 2 หมายความว่า ไม่ใช่ จำนวนเฉพาะ  ดัง code นี้

# ใช้ 2 loop ตรวจสอบ สมาชิก และ  เก็บค่า จำนวนเฉพาะ
for i in range(1,len(tuple1)):  # จำนวน เลข 1-25 ในtuple1 
    count=0  #นับ จำนวนที่หารลงตัว
    for j in range(1,i+1):   #เช็ค j  ตั้งแต่ 1 ถึง 25 j  หาร i  แล้วเท่ากับศูนย์ ให้ เพิ่มค่า count
        if i%j ==0:
            count=count+1
    if count==2:
        print(i)  # print prime
            

# logic คือ  เอาสมาชิกใน tuple  ทั้งหมด มาหาร  ตัวสมาชิกเองทั้งหมด เพื่อหาว่า มีตัวไหนเป็น จำนวนเฉพาะบ้าง
    